In [17]:
import numpy as np
import pandas as pd
import seaborn as sns
from word2number import w2n

In [18]:
df = pd.read_csv('D:\Datasets\Linear Regression Multiple Variables\hiring.csv')
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [19]:
import math
m = math.ceil(df['test_score(out of 10)'].mean())
m

8

In [20]:
df['test_score(out of 10)']= df['test_score(out of 10)'].fillna(m)
df.tail()

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    8.0                           7      72000
7     eleven                    7.0                           8      80000

In [23]:
df.experience = df.experience.fillna('one')

In [24]:
df.head()

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        one                    8.0                           9      50000
1        one                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000

In [26]:
df.experience = df.experience.apply(w2n.word_to_num)

In [27]:
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           1                    8.0                           9      50000
1           1                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    8.0                           7      72000
7          11                    7.0                           8      80000

In [28]:
x= df.iloc[:,:-1]
y= df.iloc[:,-1]

In [29]:
from sklearn import linear_model

In [30]:
mreg= linear_model.LinearRegression()
mreg.fit(x,y)

LinearRegression()

In [31]:
mreg.predict([[2,9,6]])

array([51375.54064819])

In [33]:
import pickle

In [37]:
with open('D:\Datasets\Linear Regression Multiple Variables\mreg_pickle', 'wb') as f:
    pickle.dump(mreg,f)

In [38]:
with open('D:\Datasets\Linear Regression Multiple Variables\mreg_pickle', 'rb') as f:
    mp= pickle.load(f)

In [41]:
mp.predict([[2,9,4]])

array([46404.07897249])